[
    {
        "id": 1,
        "image": "/Feature.png",
        "Title": "CabzTrack",
        "description": "CabzTrack is an android app built for cab drivers to help them track their revenue and provides detailed reports. This an ongoing project currently at the google play console closed testing stage",
        "skill": ["React Native", "Javascript", "Supabase"],
        "live": "",
        "github":""
    },
    {
        "id": 2,
        "image": "/Ameri.png",
        "Title": "AmeriPro",
        "description": "AmeriPro sought to revolutionize their sales workflow by introducing advanced automation technology. As part of the development team, we brought forth a paperless system, crafting a visionary mobile app that not only streamlined the previously manual sales procedures but also significantly enhanced the efficiency of their sales representatives in data recording.",
        "skill": ["React Native", "Javascript", "MongoDb", "RESTAPIs"],
        "live": "",
        "github":""
    },
    {
        "id": 3,
        "image": "/Whizz.png",
        "Title": "Whizcribs",
        "description": "Whizcribs had a fundamental need to revolutionize the gifting experience through an innovative mobile application. With a focus on gifting, Whizcribs required a mobile app to let the users re-imagine how a gift card should be delivered. An app that would enable users to send personalized gift cards in a secure environment.",
        "skill": ["React Native", "Javascript", "SqlLite"],
        "live": "",
        "github":""
    },
    {
        "id": 4,
        "image": "/kenyanAuto.png",
        "Title": "KenyanAuto",
        "description": "This is a fullstack website. It is a vehicle web app that allows users to search for vehicles in Kenya. It allows users to search and discover different vehicle makes and models before purchase. It is also mobile responsive.",
        "skill": ["React", "Javascript", "Docker", "Strapi", "Postgres", "Render"],
        "live": "https://www.kenyanauto.com/",
        "github": "https://github.com/Victor-Mutwiri/KenyanAuto"
    },
    {
        "id": 5,
        "image": "/MatchFit.png",
        "Title": "MatchFit",
        "description": "This is a fullstack website. It is a job-board web app that allows users to search for jobs by title and location. It also has a feature that allows users to apply for jobs. It also has a login and signup feature that allows Employers to login and sign up repsectively. It is also mobile responsive.",
        "skill": ["React", "Typescript", "Strapi", "Postgres", "Heroku"],
        "live": "https://matchfit-jobs.vercel.app/",
        "github": "https://github.com/Victor-Mutwiri/MatchFit"
    },
    {
        "id": 6,
        "image": "/eCitizen.png",
        "Title": "eCitizen Clone",
        "description": "This is a front-end clone of the eCitizen website. It is a government website that provides a wide range of government services to Kenyan citizens, businesses, and visitors.",
        "skill": ["React", "Vite", "Javascript"],
        "live": "https://e-citizen.vercel.app/",
        "github": "https://github.com/Victor-Mutwiri/eCitizen"
    },
    {
        "id": 7,
        "image": "/movie-review app.png",
        "Title": "Movie Review App",
        "description": "This is a front-end app that makes use of the  IMDB open API, to fetch and display movie details. It has a search feature that allows users to search for movies by title.",
        "skill": ["React", "Vite", "Javascript"],
        "live": "https://movie-review-app-sand.vercel.app/",
        "github": "https://github.com/Victor-Mutwiri/Movie-review-App"
    },
    {
        "id": 8,
        "image": "/uberEats.png",
        "Title": "UberEats Clone",
        "description": "This is a front-end clone of the UberEats website. It has a search feature that allows users to search for restaurants by name. It also has a login and signup feature that allows users to login and sign up repsectively. It is also mobile responsive unlike the original website.",
        "skill": ["React", "Vite", "Typescript"],
        "live": "https://uber-eats-green.vercel.app/",
        "github": "https://github.com/Victor-Mutwiri/UberEats"
    },
    {
        "id": 9,
        "image": "/Safari Adventures.png",
        "Title": "Safiri Adventures",
        "description": "This is a front-end website of a tours and travel agency. Data is fetched from a JSON file and displayed on the website. It is also mobile responsive.",
        "skill": ["React", "Vite", "Javascript", "JSON"],
        "live": "https://travel-json.vercel.app/",
        "github": "https://github.com/Victor-Mutwiri/Travel-JSON-"
    },
    {
        "id": 10,
        "image": "/Finance Logger App.png",
        "Title": "Finance Logger App",
        "description": "This is a front-end web app for finance logging that helps track payments. It has a feature that allows users to add and delete transactions. It is also mobile responsive.",
        "skill": ["HTML", "CSS", "Javascript"],
        "live": "https://finance-logger-app.vercel.app/",
        "github": "https://github.com/Victor-Mutwiri/Finance-logger-App"
    }
]